[
    {
        "intension": "การทักทาย", 
        "inquery_sentence": "สวัสดีครับ", 
        "response_sentence": "สวัสดีครับ ต้องการสอบถามเรื่องอะไรครับ" 
        
    }, 
    {
        "intension": "การฝึกงาน", 
        "inquery_sentence": "อยากสอบถามการฝึกงานหน่อยครับ", 
        "response_sentence": "ต้องการสอบถามอะไรของการฝึกงานเหรอครับ" 
        
    }, 
    {
        "intension": "การฝึกงาน_เกณฑ์", 
        "inquery_sentence": "เกณฑ์ของภาควิชาเป็นอย่างไรบ้างครับ", 
        "response_sentence": "ต้องผ่านรายวิชาของภาคเป็นจำนวน 80% ของทั้งหมดก่อนครับ" 
        
    }, 
    {
        "intension": "การจากลา", 
        "inquery_sentence": "ขอบคุณครับ", 
        "response_sentence": "ครับ ยินดีครับ" 
        
    }, 
    {
        "intension": "การฝึกงาน_หน่วยกิตขั้นต่ำ",
        "inquery_sentence": "อยากทราบว่าต้องลงทะเบียนผ่านทั้งหมดกี่หน่วยกิต ถึงจะสามารถลงทะเบียนวิชาฝึกงานได้เหรอครับ", 
        "response_sentence": "ต้องผ่านรายวิชาของทางภาควิชาที่เป็นของปี 1 , ปี 2 และ ปี 3 เทอม 1 จำนวน 48 หน่วยกิตก่อนครับ ถึงจะมีสิทธิ์ฝึกงานได้ครับ" 
        
    }, 
    {
        "intension": "วิชาเปิดสอน_เทอม_1", 
        "inquery_sentence": "วิชาที่เปิดสอนครับ ของเทอม 1 ครับ", 
        "response_sentence": "ก็จะมีวิชา อินโทรคอม แล้วก็ แล็ปซอฟแวร์ ตัวที่ 1 ของปี 2, ปี 3 แล้วก็ แล็ปฮาร์ดแวร์ ตัวที่ 1 ของปี 2 แล้วก็ แล็ปปี 3 ตัวที่ 1 แล้วก็ เซอร์กิต แล้วก็ อินโทร เน็ตเวิร์ก แล้วก็ การเขียนโปรแกรมตัวที่ 1 แล้วก็ ดิจิตอลโลจิก แล้วก็ คอม อินจิเนียร์ แมท แล้วก็ อิติก แล้วก็ โอเอส แล้วก็ ดาต้าเบส แล้วก็ ไวร์เลส แล้วก็ คอม อาคิเทค แล้วก็ โปรเจคตัวที่ 1 ครับ" 
         
    }, 
    {
        "intension": "วิชาเปิดสอน_เทอม_2", 
        "inquery_sentence": "วิชาที่เปิดสอนครับ ของเทอม 2 ครับ", 
        "response_sentence": "ก็จะมีวิชา อินโทรคอม แล้วก็ แล็ปซอฟแวร์ ตัวที่ 2 ของปี 2, ปี 3 แล้วก็ แล็ปฮาร์ดแวร์ ตัวที่ 2 ของปี 2, แล้วก็ แล็ปปี 3 ตัวที่ 2 แล้วก็ การเขียนโปรแกรมตัวที่ 1 และ การเขียนโปรแกรมตัวที่ 2 แล้วก็ ซอฟเอน แล้วก็ แสตท แล้วก็ ดิสครีตแมท แล้วก็ ดาต้า แล้วก็ เตรียมพร้อมการทำโปรเจค แล้วก็ ไมโคร แล้วก็ อัลกอ แล้วก็ เซอร์ฟเวอร์-ไคล์แอนด์ แล้วก็ ซีเคียว แล้วก็ โปรเจคตัวที่ 2 ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_introcom", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชา อินโทรคอม เหรอครับ", 
        "response_sentence": "มี อาจารย์นิคม อาจารย์อนันท์ อาจารย์อารีย์ อาจารย์สกุณา อาจารย์แสงสุรีย์ อาจารย์ธนาธิป อาจารย์เสกสรรค์ และก็ อาจารย์วีศักดิ์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_LabSoft1_2", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาแล็ปซอฟแวร์ ของ ปี 2 เทอม 1 เหรอครับ", 
        "response_sentence": "มี อาจารย์ทศพร อาจารย์สุนทร อาจารย์ธัชชัย อาจารย์สมชัย อาจารย์ไพจิตร อาจารย์อารีย์ และ อาจารย์อนันท์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_LabSoft2_2", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาแล็ปซอฟแวร์ ของ ปี 2 เทอม 2 เหรอครับ", 
        "response_sentence": "มี อาจารย์เพ็ชรัตน์ อาจารย์อารีย์ อาจารย์สมชัย อาจารย์ANDREW อาจารย์นิคม อาจารย์พิชญา อาจารย์อนันท์ และ อาจารย์แสงสุรีย์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_LabHard2_1", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาแล็ปฮาร์ดแวร์ ของ ปี 2 เทอม 1 เหรอครับ", 
        "response_sentence": "มี อาจารย์วชรินทร์ อาจารย์ปัญญยศ อาจารย์ดำรงค์ อาจารย์ธเนศ และ อาจารย์มนตรี ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_LabHard2_2", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาแล็ปฮาร์ดแวร์ ของ ปี 2 เทอม 2 เหรอครับ", 
        "response_sentence": "มี อาจารย์วชรินทร์ อาจารย์ปัญญยศ อาจารย์มนตรี อาจารย์ธเนศ และ อาจารย์ดำรงค์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Circuit", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาเซอร์กิต เหรอครับ", 
        "response_sentence": "มี อาจารย์ดำรง และ อาจารย์มนตรี ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_IntroNetwork", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาอินโทร เน็ตเวิร์ก เหรอครับ", 
        "response_sentence": "มี อาจารย์ธัชชัย ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Programming1_เทอม_1", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาการเขียนโปรแกรมตัวที่ 1 ของเทอม 1 เหรอครับ", 
        "response_sentence": "มี อาจารย์สุธน และ อาจารย์ธนาธิป ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_DigitalLogic", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาดิจิตอลโลจิก เหรอครับ", 
        "response_sentence": "มี อาจารย์ทวีศักดิ์ และ อาจารย์ปัญญยศ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Math_3", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาคอม อินจิเนียร์ แมท เหรอครับ", 
        "response_sentence": "มี อาจารย์ธเนศ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Programming1_เทอม_2", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาการเขียนโปรแกรมตัวที่ 1 ของเทอม 2 เหรอครับ", 
        "response_sentence": "มี อาจารย์นิคม ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Programming2", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาการเขียนโปรแกรมตัวที่ 2 เหรอครับ", 
        "response_sentence": "มี อาจารย์ธนาธิป ครับ"
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_SoftEng", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาซอฟเอน เหรอครับ", 
        "response_sentence": "มี อาจารย์สมชัย ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Stats", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาสแตท เหรอครับ", 
        "response_sentence": "มี อาจารย์ทศพร ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Discrete", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาดิสครีตแมท เหรอครับ", 
        "response_sentence": "มี อาจารย์Andrew ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_DataComu", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาดาต้า เหรอครับ", 
        "response_sentence": "มี อาจารย์สินชัย อาจารย์เพ็ชรัตน์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Lab3_1", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาแล็ป 1 ของปี 3 เหรอครับ", 
        "response_sentence": "มี อาจารย์ทวีศักดิ์ อาจารย์เสกสรรค์ อาจารย์สุธน อาจารย์ปัญญยศ อาจารย์วรรณรัช อาจารย์สุนทร อาจารย์วชรินทร์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Ethical", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาอิติก เหรอครับ", 
        "response_sentence": "มี อาจารย์ไพจิตร อาจารย์พิชญา ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_OS", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาโอเอส เหรอครับ", 
        "response_sentence": "มี อาจารย์แสงสุรีย์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Database", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาดาต้าเบส เหรอครับ", 
        "response_sentence": "มี อาจารย์ไพจิตร ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Wireless", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาไวร์เลส เหรอครับ", 
        "response_sentence": "มี อาจารย์เพ็ชรัตน์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_ComArch", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาคอมอาคิเทค เหรอครับ", 
        "response_sentence": "มี อาจารย์วชรินทร์ อาจารย์ปัญญยศ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Lab3_2", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาแล็ปปี 3 ตัวที่ 2 เหรอครับ", 
        "response_sentence": "มี อาจารย์ทวีศักดิ์  อาจารย์สุนทร อาจารย์ธนาธิป อาจารย์เสกสรรค์ อาจารย์อนันท์ อาจารย์ปัญญยศ อาจารย์วรินทร์ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Micro", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาไมโคร เหรอครับ", 
        "response_sentence": "มี อาจารย์ทวีศักดิ์ อาจารย์ปัญญยศ ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Algro", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาอัลกอ เหรอครับ", 
        "response_sentence": "มี อาจารย์Andrew ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Server_Client", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาเซิร์ฟเวอร์-ไคลแอนด์ เหรอครับ", 
        "response_sentence": "มี อาจารย์สุธน ครับ" 
        
    }, 
    {
        "intension": "อาจารย์ผู้สอน_Security", 
        "inquery_sentence": "อาจารย์ท่านไหน สอน วิชาซีเคียว เหรอครับ", 
        "response_sentence": "มี อาจารย์แสงสุรีย์ ครับ", 
        "intension_set": ""
    }, 
    {
        "intension": "ยืนยันคำถาม_ฝึกงาน", 
        "inquery_sentence": "ฝึกงาน", 
        "response_sentence": "หมายถึงเรื่องการฝึกงานใช่ไหมครับ", 
        
    }
]