[
    {
        "intension": "การทักทาย", 
        "inquery_sentence": "สวัสดีครับ", 
        "response_sentence": "สวัสดีครับ ต้องการสอบถามเรื่องอะไรครับ", 
        "intension_set": ""
    }, 
    {
        "intension": "การฝึกงาน", 
        "inquery_sentence": "อยากสอบถามการฝึกงานหน่อยครับ", 
        "response_sentence": "ต้องการสอบถามอะไรของการฝึกงานเหรอครับ", 
        "intension_set": ""
    }, 
    {
        "intension": "การฝึกงาน_เกณฑ์", 
        "inquery_sentence": "เกณฑ์ของภาควิชาเป็นอย่างไรบ้างครับ", 
        "response_sentence": "ต้องผ่านรายวิชาของภาคเป็นจำนวน 80% ของทั้งหมดก่อนครับ", 
        "intension_set": ""
    }, 
    {
        "intension": "การจากลา", 
        "inquery_sentence": "ขอบคุณครับ", 
        "response_sentence": "ครับ ยินดีครับ", 
        "intension_set": ""
    }, 
    {
        "intension": "การฝึกงาน_หน่วยกิตขั้นต่ำ",
        "inquery_sentence": "อยากทราบว่าต้องลงทะเบียนทั้งหมดกี่หน่วยกิต ถึงจะสามารถลงทะเบียนวิชาฝึกงานได้เหรอครับ", 
        "response_sentence": "ต้องผ่านรายวิชาของทางภาควิชาที่เป็นของปี 1 , ปี 2 และ ปี 3 เทอม 1 จำนวน 48 หน่วยกิตก่อนครับ ถึงจะมีสิทธิ์ฝึกงานได้ครับ", 
        "intension_set": ""
    }, 
    {
        "intension": "วิชาเปิดสอน_เทอม_1", 
        "inquery_sentence": "วิชาที่เปิดสอนครับ ของเทอม 1 ครับ", 
        "response_sentence": "ก็จะมีวิชา Introcom แล้วก็ Software Lab ของปี 2, ปี 3 แล้วก็ Hardware Lab ของปี 2, ปี 3 แล้วก็ Circuit แล้วก็ Intro Network แล้วก็ การเขียนโปรแกรมตัวที่ 1 แล้วก็ Digital-Logic แล้วก็ Com-Engineer Math แล้วก็ Ethical แล้วก็ OS แล้วก็ Database แล้วก็ Wireless แล้วก็ Com-Architecture แล้วก็ Project 1 ครับ", 
        "intension_set": "" 
    }, 
    {
        "intension": "วิชาเปิดสอน_เทอม_2", 
        "inquery_sentence": "วิชาที่เปิดสอนครับ ของเทอม 2 ครับ", 
        "response_sentence": "ก็จะมีวิชา อินโทรคอม แล้วก็ แล็ปซอฟแวร์ ตัวที่ 2 ของปี 2, ปี 3 แล้วก็ แล็ปฮาร์ดแวร์ ตัวที่ 2 ของปี 2, ปี 3 แล้วก็ การเขียนโปรแกรมตัวที่ 1 และ การเขียนโปรแกรมตัวที่ 2 แล้วก็ วิศวกรรมซอฟแวร์ แล้วก็ แสตท แล้วก็ ดิสครีตแมท แล้วก็ ดาต้า แล้วก็ เตรียมพร้อมการทำโปรเจค แล้วก็ ไมโคร แล้วก็ โปรเจคตัวที่ 2 ครับ", 
        "intension_set": ""
    }, 
    {
        
    }
]